In [56]:
%pylab inline
import sqlite3
import pandas as pd 
from pandas import Series, DataFrame

Populating the interactive namespace from numpy and matplotlib

In [67]:
# Connect to your database
conn = sqlite3.connect('chinook.db')  

# Define your SQL queries

sql_queries = [
    """
    SELECT LastName, FirstName
    FROM Customer
    ORDER BY LastName, FirstName
    """,
    """
    SELECT Name
    FROM Track
    """,
    """
    SELECT Title
    FROM Album
    """
]

# Execute each query and read the results into a Pandas DataFrame
dfs = []
for query in sql_queries:
    df = pd.read_sql_query(query, conn)
    dfs.append(df)

# Concatenate the DataFrames into a single DataFrame
updated_df = pd.concat(dfs, axis=1)


# Display the resulting DataFrame
updated_df.head()

,LastName,FirstName,Name,Title
0,Almeida,Roberto,For Those About To Rock (We Salute You),For Those About To Rock We Salute You
1,Barnett,Julia,Balls to the Wall,Balls to the Wall
2,Bernard,Camille,Fast As a Shark,Restless and Wild
3,Brooks,Michelle,Restless and Wild,Let There Be Rock
4,Brown,Robert,Princess of the Dawn,Big Ones